
## Plan Result (stg)




<pre><code>Plan: 2 to add, 4 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_monitor_action_group.blob-action-group
  * azurerm_monitor_metric_alert.example
* Update
  * azurerm_eventgrid_topic.mig-scanner[0]
  * azurerm_log_analytics_workspace.migration-analytics[0]
  * azurerm_recovery_services_vault.darts-migration-backup[0]
  * azurerm_windows_virtual_machine.modernisation_windows[&#34;stgdartsmidmock&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_eventgrid_topic.mig-scanner[0] will be updated in-place
  ~ resource "azurerm_eventgrid_topic" "mig-scanner" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.EventGrid/topics/darts-event-stg"
        name                          = "darts-event-stg"
      ~ tags                          = {
          - "application"  = "darts" -> null
          - "builtFrom"    = "https://github.com/HMCTS/darts-shared-infrastructure.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "staging" -> null
        }
        # (9 unchanged attributes hidden)
    }

  # azurerm_log_analytics_workspace.migration-analytics[0] will be updated in-place
  ~ resource "azurerm_log_analytics_workspace" "migration-analytics" {
        id                                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.OperationalInsights/workspaces/darts-migration-analytics-workspace"
        name                                    = "darts-migration-analytics-workspace"
      ~ tags                                    = {
          - "application"  = "darts" -> null
          - "builtFrom"    = "https://github.com/HMCTS/darts-shared-infrastructure.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "staging" -> null
        }
        # (14 unchanged attributes hidden)
    }

  # azurerm_monitor_action_group.blob-action-group will be created
  + resource "azurerm_monitor_action_group" "blob-action-group" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "blob-ingress-action-group"
      + resource_group_name = "darts-migration-stg-rg"
      + short_name          = "example"

      + email_receiver {
          + email_address           = "sean.bulley@hmcts.net"
          + name                    = "Sean Bulley"
          + use_common_alert_schema = true
        }
      + email_receiver {
          + email_address           = "scott.robertson@hmcts.net"
          + name                    = "Scott Robertson"
          + use_common_alert_schema = true
        }
    }

  # azurerm_monitor_metric_alert.example will be created
  + resource "azurerm_monitor_metric_alert" "example" {
      + auto_mitigate            = true
      + description              = "Alert triggered when blob ingress drops below a threshold for 30 minutes"
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "blob-alert"
      + resource_group_name      = "darts-migration-stg-rg"
      + scopes                   = [
          + "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Storage/storageAccounts/saproddartsmig02",
        ]
      + severity                 = 3
      + tags                     = {
          + "environment" = "Production"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "BlobIngress"
          + metric_namespace       = "Microsoft.Storage/storageAccounts"
          + operator               = "LessThan"
          + skip_metric_validation = false
          + threshold              = 90000
        }
    }

  # azurerm_recovery_services_vault.darts-migration-backup[0] will be updated in-place
  ~ resource "azurerm_recovery_services_vault" "darts-migration-backup" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.RecoveryServices/vaults/darts-prod-rsv"
        name                          = "darts-prod-rsv"
      ~ tags                          = {
          - "application"  = "darts" -> null
          - "builtFrom"    = "https://github.com/HMCTS/darts-shared-infrastructure.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "staging" -> null
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_windows_virtual_machine.modernisation_windows["stgdartsmidmock"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "modernisation_windows" {
        id                                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Compute/virtualMachines/stgdartsmidmock"
        name                                                   = "stgdartsmidmock"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 4 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":230,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->